nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
        <register>
          <name>STARTERSET3</name>
          <description>Set bits in STARTER</description>
          <addressOffset>0x6AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXPWM1_COMPARE1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_RELOAD1_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_COMPARE2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_RELOAD2_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_COMPARE3_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXPWM1_RELOAD3_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC0_COMPARE_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC0_HOME_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC0_WDG_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC0_IDX_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC1_COMPARE_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC1_HOME_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC1_WDG_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC1_IDX_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRC_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELS_ERR_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKC_ERR_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVTVF0_AMBER_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVTVF0_RED_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVTVF1_AMBER_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVTVF1_RED_SET</name>
              <description>Writing ones to this register sets the corresponding bit in the STARTER3 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTERCLR0</name>
          <description>Clear bits in STARTER</description>
          <addressOffset>0x6C0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF97FFFFF</resetMask>
          <fields>
            <field>
              <name>SYS_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDMA0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_GLOBALINT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_GLOBALINT1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT00_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT01_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT02_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT03_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UTICK0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MRT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SCT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER3_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT2_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT3_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT4_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT5_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT6_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLEXINT7_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC0_THCMP_OVR_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB0_NEEDCLK_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_LITE0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUP_MAILBOX0_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER0 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTERCLR1</name>
          <description>Clear bits in STARTER</description>
          <addressOffset>0x6C4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x8FFF847F</resetMask>
          <fields>
            <field>
              <name>GPIO_INT04_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT05_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT06_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO_INT07_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER2_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTIMER4_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OS_EVENT_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_HYPERVISOR_CALL_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_GPIO_INT00_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEC_GPIO_INT01_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QDDKEY_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PQ_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDMA1_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_HS_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WAKEUPPADS_CLR</name>
              <description>Writing ones to this register clears the corresponding bit in the STARTER1 register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCRETENTIONCTRL</name>
          <description>Functional retention control</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x50C000</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>FUNCRETENA</name>
              <description>functional retention in power down only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable functional retention.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable functional retention.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RET_START</name>
              <description>Start address divided by 4 inside SRAMX bank.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RET_LENTH</name>
              <description>lenth of Scan chains to save.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
