nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
        <register>
          <name>ELS_FEATURE1_DP</name>
          <description>ELS command feature - duplicate version</description>
          <addressOffset>0x99C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CKDF</name>
              <description>Enables CKDF command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HKDF</name>
              <description>Enables HKDF command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TLS_INIT</name>
              <description>Enables TLS_INIT command.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HASH</name>
              <description>Enables HASH command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC</name>
              <description>Enables HMAC command.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMAC</name>
              <description>Enables CMAC command.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRBG_REQ</name>
              <description>Enables DRBG_REQ command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRBG_TEST</name>
              <description>Enables DRBG_TEST command.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTRNG_CFG_LOAD</name>
              <description>Enables DTRNG_CFG_LOAD command.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTRNG_EVAL</name>
              <description>Enables DTRNG_EVAL command.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDET_CFG_LOAD</name>
              <description>Enables GDET_CFG_LOAD command.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_BOOT_RETRY_CNT</name>
          <description>ELS boot retry counter</description>
          <addressOffset>0x9A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_RETRY_CNT</name>
              <description>Boot retry counter bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_CLK_CTRL</name>
          <description>ELS clock control</description>
          <addressOffset>0x9B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDET_REFCLK_EN</name>
              <description>GDET reference clock enable bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTRNG_REFCLK_EN</name>
              <description>DTRNG reference clock enable bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_CLK_CTRL_SET</name>
          <description>ELS clock control set</description>
          <addressOffset>0x9B4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDET_REFCLK_EN_SET</name>
              <description>GDET reference clock enable set bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTRNG_REFCLK_EN_SET</name>
              <description>DTRNG reference clock enable set bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_CLK_CTRL_CLR</name>
          <description>ELS clock control clear</description>
          <addressOffset>0x9B8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDET_REFCLK_EN_CLR</name>
              <description>GDET reference clock enable clear bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTRNG_REFCLK_EN_CLR</name>
              <description>DTRNG reference clock enable clear bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_CLK_SEL</name>
          <description>ELS clock select</description>
          <addressOffset>0x9BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDET_REFCLK_SEL</name>
              <description>GDET reference clock select bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG0</name>
          <description>ELS AS configuration</description>
          <addressOffset>0x9D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFF00355</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_LC_STATE</name>
              <description>LC state configuration bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_BOD_VBAT_RESET_ENABLED</name>
              <description>When BOD VDDMAIN analog detector is turned on and BOD VDDMAIN reset is enabled, this bit indicates state 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_BOD_CORE_RESET_ENABLED</name>
              <description>When BOD CORE analog detector is turned on and BOD CORE reset is enabled, this bit indicates state 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_BOD_VBAT_IRQ_ENABLED</name>
              <description>When BOD VDDMAIN analog detector is turned on and BOD VDDMAIN IRQ is enabled, this bit indicates state 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_WDT_ENABLED</name>
              <description>When WatchDog Timer is activated, this bit indicates state 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_CWDT_ENABLED</name>
              <description>When Code WatchDog Timer is activated, this bit indicates state 1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_ELS_GDET_ENABLED</name>
              <description>When ELS GDET is enabled, this bit indicates state 1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_TAMPER_DET_ENABLED</name>
              <description>When tamper detector is enabled in RTC, this bit indicates state 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_FLASH_IS_REMAPPED</name>
              <description>When FLASHREMAP_OFFSET register (0x4000_0448) is not equal to 0x0000_0000, this bit indicates state 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_FLASH_IS_REMAPPED_DP</name>
              <description>When FLASHREMAP_OFFSET_DP register (0x4000_044C) is not equal to 0x0000_0000, this bit indicates state 1.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_FLASH_BANK0_ENABLE</name>
              <description>The state of FLASHBANK_ENABLE0 register (0x4000_0450) reflects to this register as below.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_FLASH_BANK1_ENABLE</name>
              <description>The state of FLASHBANK_ENABLE1 register (0x4000_0454) reflects to this register as below:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_QK_DISABLE_ENROLL</name>
              <description>When CONFIG[DIS_PUF_ENROLL] bit is set 1, this bit indicates state 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_QK_DISABLE_WRAP</name>
              <description>When CONFIG[DIS_PUF_WRAP_KEY] bit is set 1, this bit indicates state 1.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG1</name>
          <description>ELS AS configuration1</description>
          <addressOffset>0x9D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x22</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_SEC_DIS_STRICT_MODE</name>
              <description>When &quot;CFG_SEC_ENA_SEC_CHK&quot; indicates state 0 or when &quot;DISABLE_STRICT_MODE&quot; bits in &quot;MISC_CTRL_REG&quot; and &quot;MISC_CTRL_DP_REG&quot; on AHB secure controller, both bits are equal to 01, this bit indicates state 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_DIS_VIOL_ABORT</name>
              <description>When &quot;DISABLE_VIOLATION_ABORT&quot; bits in &quot;MISC_CTRL_REG&quot; and &quot;MISC_CTRL_DP_REG&quot; on AHB secure controller, both bits are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_NS_PRIV_CHK</name>
              <description>When &quot;ENABLE_NS_PRIV_CHECK&quot; bits in &quot;MISC_CTRL_REG&quot; and &quot;MISC_CTRL_DP_REG&quot; on AHB secure controller, both bits are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_S_PRIV_CHK</name>
              <description>When &quot;ENABLE_S_PRIV_CHECK&quot; bits in &quot;MISC_CTRL_REG&quot; and &quot;MISC_CTRL_DP_REG&quot; on AHB secure controller, both bits are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_SEC_CHK</name>
              <description>When &quot;ENABLE_SECURE_CHECKING&quot; bits in &quot;MISC_CTRL_REG&quot; and &quot;MISC_CTRL_DP_REG&quot; on AHB secure controller, both bits are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_IDAU_ALLNS</name>
              <description>When &quot;IDAU_ALL_NS&quot; bits in &quot;MISC_CTRL_REG&quot; and &quot;MISC_CTRL_DP_REG&quot; on AHB secure controller, both bits are equal to 01, this bit indicates state 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_NS_MPU</name>
              <description>When &quot;LOCK_NS_MPU&quot; bits in &quot;CPU0_LOCK_REG&quot; on AHB secure controller are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_NS_VTOR</name>
              <description>When &quot;LOCK_NS_VTOR&quot; bits in &quot;CPU0_LOCK_REG&quot; on AHB secure controller are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_S_MPU</name>
              <description>When &quot;LOCK_S_MPU&quot; bits in &quot;CPU0_LOCK_REG&quot; on AHB secure controller are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_S_VTAIRCR</name>
              <description>When &quot;LOCK_S_VTAIRCR&quot; bits in &quot;CPU0_LOCK_REG&quot; on AHB secure controller are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_SAU</name>
              <description>When &quot;LOCK_SAU&quot; bits in &quot;CPU0_LOCK_REG&quot; on AHB secure controller are not equal to 10, this bit indicates state 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG2</name>
          <description>ELS AS configuration2</description>
          <addressOffset>0x9D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_ELS_CMD_EN</name>
              <description>ELS configuration command enable bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_ST0</name>
          <description>ELS AS state register</description>
          <addressOffset>0x9E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xDC00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_TEMPORAL_STATE</name>
              <description>&quot;TEMPORAL_STATE[3:0]&quot; on &quot;ELS_TEMPORAL_STATE&quot; register reflects this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_DBGEN</name>
              <description>When CPU0 (CM33) &quot;deben&quot; input is state 1, this bit indicates state 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_NIDEN</name>
              <description>When CPU0 (CM33) &quot;niden&quot; input is state 1, this bit indicates state 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_SPIDEN</name>
              <description>When CPU0 (CM33) &quot;spiden&quot; input is state 1, this bit indicates state 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_SPNIDEN</name>
              <description>When CPU0 (CM33) &quot;spniden&quot; input is state 1, this bit indicates state 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DAP_ENABLE_CPU0</name>
              <description>When DAP to AP0 for CPU0 (CM33) debug access is allowed, this bit indicates state 1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_ELS_DEBUG_EN</name>
              <description>When ELS uCode code fetch out of AHB for debug is enabled, this bit indicates state 1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_ALLOW_TEST_ACCESS</name>
              <description>When JTAG TAP access is allowed, this bit indicates state 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_XO32K_FAILED</name>
              <description>When XO32K oscillation fail flag is state 1 in PMC register block, this bit indicates state 1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_ST1</name>
          <description>ELS AS state1</description>
          <addressOffset>0x9E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x18F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_QK_PUF_SCORE</name>
              <description>These register bits indicate the state of &quot;qk_puf_score[3:0]&quot; outputs from QK PUF block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_QK_ZEROIZED</name>
              <description>This register bit indicates the state of &quot;qk_zeroized&quot; output from QK PUF block.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_MAIN_CLK_IS_EXT</name>
              <description>When MAIN_CLK is running from external clock source either XO32M, XO32K or GPIO CLKIN, this bit indicates state 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DCDC_VOUT</name>
              <description>VOUT[3:0] setting on DCDC0 register in PMC block will reflect to this register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_BOOT_MODE</name>
              <description>BOOTMODE[1:0] status on STATUS register in PMC block will reflect to this register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_BOOT_RETRY_CNT</name>
              <description>&quot;BOOT_RETRY_CNT[3:0]&quot; on &quot;ELS_BOOT_RETRY_CNT&quot; register reflects this register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
