nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA0_ITRIG_INMUX[%s]</name>
          <description>Trigger select for DMA0 channel</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Trigger input number (binary value) for DMA channel n (n = 0 to 31).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>FlexSPI_RX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>FlexSPI_TX</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>GPIO_INT0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>GPIO_INT1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>GPIO_INT2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>GPIO_INT3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>T0_DMAREQ_M0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>T0_DMAREQ_M1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>T1_DMAREQ_M0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>T1_DMAREQ_M1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>T2_DMAREQ_M0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>T2_DMAREQ_M1</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>T3_DMAREQ_M0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>T3_DMAREQ_M1</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>T4_DMAREQ_M0</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>T4_DMAREQ_M1</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>ACMP0_OUT</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>SDMA0_TRIGOUT_A</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>SDMA0_TRIGOUT_B</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>SDMA0_TRIGOUT_C</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>SDMA0_TRIGOUT_D</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>SCT_DMA0</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>SCT_DMA1</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>ADC0_tcomp[0]</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>ADC1_tcomp[0]</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>HSCMP0</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>HSCMP1</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>HSCMP2</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>AOI0_OUT0</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>AOI0_OUT1</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>AOI0_OUT2</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>AOI0_OUT3</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>AOI1_OUT0</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>AOI1_OUT1</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>AOI1_OUT2</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>AOI1_OUT3</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>FlexPWM0_req_capt0</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>FlexPWM0_req_capt1</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>FlexPWM0_req_capt2</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>FlexPWM0_req_capt3</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>FlexPWM0_req_val0</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>FlexPWM0_req_val1</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>FlexPWM0_req_val2</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>FlexPWM0_req_val3</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>FlexPWM1_req_capt0</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>FlexPWM1_req_capt1</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>FlexPWM1_req_capt2</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>FlexPWM1_req_capt3</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>FlexPWM1_req_val0</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>FlexPWM1_req_val1</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>FlexPWM1_req_val2</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>FlexPWM1_req_val3</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>TMPR_OUT</description>
                  <value>0x34</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA0_OTRIG_INMUX[%s]</name>
          <description>DMA0 output trigger selection for DMA0 input trigger</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>DMA trigger output number (binary value) for DMA channel n (n = 0 to 52).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQMEAS_REF</name>
          <description>Selection for frequency measurement reference clock</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CLKIN</name>
              <description>Clock source number (binary value) for frequency measure function target clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>XTAL32MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>FRO_OSC_12M</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b2</name>
                  <description>FRO_OSC_96M</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b3</name>
                  <description>WDOSC (FRO1M)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b4</name>
                  <description>32KHZ_OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b5</name>
                  <description>MAIN_SYS_CLOCK</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b6</name>
                  <description>FREQME_GPIO_CLK_A</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b7</name>
                  <description>FREQME_GPIO_CLK_B</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b8</name>
                  <description>AOI0_OUT2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b9</name>
                  <description>AOI1_OUT2</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQMEAS_TAR</name>
          <description>Selection for frequency measurement target clock</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CLKIN</name>
              <description>Clock source number (binary value) for frequency measure function target clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>b0</name>
                  <description>XTAL32MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b1</name>
                  <description>FRO_OSC_12M</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b2</name>
                  <description>FRO_OSC_96M</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b3</name>
                  <description>WDOSC (FRO1M)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b4</name>
                  <description>32KHZ_OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b5</name>
                  <description>MAIN_SYS_CLOCK</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b6</name>
                  <description>FREQME_GPIO_CLK_A</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b7</name>
                  <description>FREQME_GPIO_CLK_B</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b8</name>
                  <description>AOI0_OUT2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>b9</name>
                  <description>AOI1_OUT2</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
