nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>PMC</description>
      <groupName>PMC</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ACMP</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Power Management Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>LPMODE</name>
              <description>Power Mode Control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>ACTIVE power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>DEEP-SLEEP low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>POWER-DOWN low power mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPOWERDOWN</name>
                  <description>DEEP-POWER-DOWN low power mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELCLOCK</name>
              <description>Select the Power Management Controller (PMC) functional clock :</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO1MHZ</name>
                  <description>1 MHz Free Running Oscillator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO12MHZ</name>
                  <description>12 MHz Free Running Oscillator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELMEMSUPPLY</name>
              <description>Select Memories supply source in DEEP-SLEEP low power mode: Note: in POWER-DOWN and DEEP-POWER-DOWN, memories are always supplied by LDO_MEM.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOMEM</name>
                  <description>Memories are supplied by LDO_MEM in 'DEEP-SLEEP' low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>Memories are supplied by DCDC/LDO_CORE in 'DEEP-SLEEP' low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELCORESUPPLYWK</name>
              <description>Select Core Logic supply source when waking up from DEEP-SLEEP and POWER-DOWN low power modes :</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>Core Logic is supplied by DCDC Converter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOCORE</name>
                  <description>Core Logic is supplied by LDO CORE (configured in High Power mode).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEEPSLEEPCORESUPPLY</name>
              <description>Select Core Logic supply source during DEEP-SLEEP low power mode :</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOCORELP</name>
                  <description>LDO CORE in Low Power Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOCOREHP</name>
                  <description>LDO CORE in High Power Mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDC</name>
                  <description>DCDC Converter.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>PMC status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF80FFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTMODE</name>
              <description>Latest IC Boot cause:.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERUP</name>
                  <description>Latest IC boot was a Full power cycle boot sequence (PoR, Pin Reset, Brown Out Detectors Reset, Software Reset).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Latest IC boot was from DEEP-SLEEP low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Latest IC boot was from POWER-DOWN low power mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPOWERDOWN</name>
                  <description>Latest IC boot was from DEEP-POWER-DOWN low power mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMDCDCENABLE</name>
              <description>Indicates the power status of the DCDC (enabled or disabled) as driven by the Hardware Finite State Machines (FSM).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DCDC is currently disabled by the Hardware Finite State Machine (FSM).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DCDC is currently enabled by the Hardware Finite State Machine (FSM).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMLDOCOREHPENABLE</name>
              <description>Indicates the power status of the LDO CORE High Power Mode (enabled or disabled) as driven by the Hardware Finite State Machines (FSM).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LDO CORE High Power Mode is currently disabled by the Hardware Finite State Machine (FSM).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LDO CORE High Power Mode is currently enabled by the Hardware Finite State Machine (FSM).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMLDOCORELPENABLE</name>
              <description>Indicates the power status of the LDO CORE Low Power Mode (enabled or disabled) as driven by the Hardware Finite State Machines (FSM).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LDO CORE Low Power Mode is currently disabled by the Hardware Finite State Machine (FSM).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LDO CORE Low Power Mode is currently enabled by the Hardware Finite State Machine (FSM).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMLDOCOREEXPTMRENABLE</name>
              <description>Indicates the status of the LDO CORE Exponential Timer (enabled or disabled) as driven by the Hardware Finite State Machines (FSM).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETCTRL</name>
          <description>Reset Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x50000050</resetValue>
          <resetMask>0xF00000F9</resetMask>
          <fields>
            <field>
              <name>DPDWAKEUPRESETENABLE</name>
              <description>Wake-up from DEEP-POWER-DOWN reset event (either from wake up I/O or RTC or OS Event Timer).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Reset event from DEEP-POWER-DOWN mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Reset event from DEEP-POWER-DOWN mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRRESETENABLE</name>
              <description>Software reset enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Software reset is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Software reset is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODVDDMAINRESETENA_SECURE</name>
              <description>BOD_VDDMAIN reset enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>And any other value than b10: BOD_VDDMAIN reset is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD_VDDMAIN reset is disabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODCORERESETENA_SECURE</name>
              <description>BOD_CORE reset enabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>And any other value than b10: BOD_CORE reset is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BODCORE reset is disabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODVDDMAINRESETENA_SECURE_DP</name>
              <description>BOD_VDDMAIN reset enabled.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>And any other value than b10: BOD_VDDMAIN reset is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD_VDDMAIN reset is disabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODCORERESETENA_SECURE_DP</name>
              <description>BOD_CORE reset enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>And any other value than b10: BOD_CORE reset is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD_CORE reset is disabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETCAUSE</name>
          <description>Reset Cause</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1FFF</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>1 : The last chip reset was caused by a Power On Reset. Write '1' to clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PADRESET</name>
              <description>1 : The last chip reset was caused by a Pin Reset. Write '1' to clear this bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BODRESET</name>
              <description>1 : The last chip reset was caused by a Brown Out Detector (BoD), either BOD_VDDMAIN or BOD_CORE. Write '1' to clear this bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTEMRESET</name>
              <description>1 : The last chip reset was caused by a System Reset requested by the ARM CPU. Write '1' to clear this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTRESET</name>
              <description>1 : The last chip reset was caused by the Watchdog Timer. Write '1' to clear this bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRRESET</name>
              <description>1 : The last chip reset was caused by a Software. Write '1' to clear this bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_WAKEUPIO</name>
              <description>1 : A Wake-up I/O reset event occured during DEEP-POWER-DOWN mode. Write '1' to clear this bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_RTC</name>
              <description>1 : A RTC (either RTC Alarm or RTC wake up) reset event occured during DEEP-POWER-DOWN mode. Write '1' to clear this bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_OSTIMER</name>
              <description>1 : A OS Event Timer reset event occured during DEEP-POWER-DOWN mode. Write '1' to clear this bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDOGRESET</name>
              <description>1 : The last chip reset was caused by the code Watchdog. Write '1' to clear this bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPD_EVENTS_ORDER</name>
              <description>In DEEP-POWER-DOWN mode, indicates which reset event occured first between DPDRESET_WAKEUPIO, DPDRESET_RTC and DPDRESET_OSTIMER. Write 'b001' to clear these bit field.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO</name>
                  <description>WAKEUPIO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC</name>
                  <description>RTC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO_RTC</name>
                  <description>Both WAKEUPIO and RTC events occured at the same time (less than 1 nano-second from each other)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSTIMER</name>
                  <description>OSTIMER</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO_OSTIMER</name>
                  <description>Both WAKEUPIO and OSTIMER events occured at the same time (less than 1 nano-second from each other)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OSTIMER</name>
                  <description>Both RTC and OSTIMER events occured at the same time (less than 1 nano-second from each other)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUPIO_RTC_OSTIMER</name>
                  <description>WAKEUPIO, RTC and OSTIMER events occured at the same time (less than 1 nano-second from each other)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
