nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
        <register>
          <name>REFFASTWKUP</name>
          <description>Analog References fast wake-up Control</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>LPWKUP</name>
              <description>Analog References fast wake-up in case of wake-up from a low power mode (DEEP-SLEEP, POWER-DOWN and DEEP-POWER-DOWN):</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Analog References fast wake-up feature is disabled in case of wake-up from any Low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Analog References fast wake-up feature is enabled in case of wake-up from any Low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWWKUP</name>
              <description>Analog References fast wake-up in case of Hardware Pin reset:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Analog References fast wake-up feature is disabled in case of Hardware Pin reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Analog References fast wake-up feature is enabled in case of Hardware Pin reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL32K</name>
          <description>32 KHz Crystal oscillator (XTAL) control</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x204052</resetValue>
          <resetMask>0x3FFFFFE</resetMask>
          <fields>
            <field>
              <name>TEST</name>
              <description>Oscillator Bypass Test Mode control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FUNC</name>
                  <description>Oscillation mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass test mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPBANKIN</name>
              <description>Capa bank setting input.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPBANKOUT</name>
              <description>Capa bank setting output.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP</name>
          <description>Analog Comparator control</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFF7FFE</resetMask>
          <fields>
            <field>
              <name>HYST</name>
              <description>Hysteris when hyst = '1'.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Hysteresis is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Hysteresis is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFINPUT</name>
              <description>Dedicated control bit to select between internal VREF and VDDA (for the resistive ladder).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNALREF</name>
                  <description>Select internal VREF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDA</name>
                  <description>Select VDDA.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOWPOWER</name>
              <description>Low power mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>High speed mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWSPEED</name>
                  <description>Low power mode (Low speed).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUX</name>
              <description>Control word for P multiplexer:.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>VREF (See field VREFINPUT).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_A</name>
                  <description>Pin P0_0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_B</name>
                  <description>Pin P0_9.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_C</name>
                  <description>Pin P0_18.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_D</name>
                  <description>Pin P1_14.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMUX</name>
              <description>Control word for N multiplexer:.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>VREF (See field VREFINPUT).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_A</name>
                  <description>Pin P0_0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_B</name>
                  <description>Pin P0_9.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_C</name>
                  <description>Pin P0_18.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_D</name>
                  <description>Pin P1_14.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREF</name>
              <description>Control reference voltage step, per steps of (VREFINPUT/31).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTERCGF_SAMPLEMODE</name>
              <description>Control the filtering of the Analog Comparator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER1CLK</name>
                  <description>Filter 1 clock period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER2CLK</name>
                  <description>Filter 2 clock period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER3CLK</name>
                  <description>Filter 3 clock period.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTERCGF_CLKDIV</name>
              <description>Filter Clock divider.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER_1CLK_PERIOD</name>
                  <description>Filter clock period duration equals 1 Analog Comparator clock period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_2CLK_PERIOD</name>
                  <description>Filter clock period duration equals 2 Analog Comparator clock period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_4CLK_PERIOD</name>
                  <description>Filter clock period duration equals 4 Analog Comparator clock period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_8CLK_PERIOD</name>
                  <description>Filter clock period duration equals 8 Analog Comparator clock period.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_16CLK_PERIOD</name>
                  <description>Filter clock period duration equals 16 Analog Comparator clock period.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_32CLK_PERIOD</name>
                  <description>Filter clock period duration equals 32 Analog Comparator clock period.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_64CLK_PERIOD</name>
                  <description>Filter clock period duration equals 64 Analog Comparator clock period.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_128CLK_PERIOD</name>
                  <description>Filter clock period duration equals 128 Analog Comparator clock period.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>DCDC and LDOCORE power state (enable/disable) control.</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCDCENABLE</name>
              <description>Enable DCDC (self clearing bit).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable DCDC. Automatically reset to '0' by the Hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDCDISABLE</name>
              <description>Disable DCDC (self clearing bit).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disbale DCDC. Automatically reset to '0' by the Hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOCOREHIGHPWRENABLE</name>
              <description>Enable LDO CORE High Power Mode (self clearing bit).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable LDO CORE High Power Mode. Automatically reset to '0' by the Hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOCOREHIGHPWRDISABLE</name>
              <description>Disable LDO CORE High Power Mode (self clearing bit).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable LDO CORE High Power Mode. Automatically reset to '0' by the Hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOCORELOWPWRENABLE</name>
              <description>Enable LDO CORE Low Power Mode (self clearing bit).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable LDO CORE Low Power Mode. Automatically reset to '0' by the Hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOCORELOWPWRDISABLE</name>
              <description>Disable LDO CORE Low Power Mode (self clearing bit).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable LDO CORE Low Power Mode. Automatically reset to '0' by the Hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
