nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE27</name>
              <description>Edge or level mode select bits.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE28</name>
              <description>Edge or level mode select bits.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE29</name>
              <description>Edge or level mode select bits.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE30</name>
              <description>Edge or level mode select bits.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE31</name>
              <description>Edge or level mode select bits.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATA0</name>
          <description>Interrupt status for interrupt A</description>
          <addressOffset>0x2700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATB0</name>
          <description>Interrupt status for interrupt B</description>
          <addressOffset>0x2780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC0</name>
      <description>12-bit DAC</description>
      <groupName>DAC</groupName>
      <headerStructName>DAC</headerStructName>
      <baseAddress>0x400B2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DAC0</name>
        <value>74</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version Identifier</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Identification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOSZ</name>
              <description>FIFO Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_1</name>
                  <description>FIFO depth is 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_2</name>
                  <description>FIFO depth is 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_3</name>
                  <description>FIFO depth is 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_4</name>
                  <description>FIFO depth is 32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_5</name>
                  <description>FIFO depth is 64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_6</name>
                  <description>FIFO depth is 128</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_7</name>
                  <description>FIFO depth is 256</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Data</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>FIFO Entry or Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCR</name>
          <description>Global Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DACEN</name>
              <description>DAC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACRFS</name>
              <description>DAC Reference Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREFH1</name>
                  <description>Selects VREFH1 as the reference voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFH2</name>
                  <description>Selects VREFH2 as the reference voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFH3</name>
                  <description>Selects VREFH3 as the reference voltage</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOEN</name>
              <description>FIFO Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFFER_MODE</name>
                  <description>Enables FIFO mode and disables Buffer mode. Any data written to goes to buffer then goes to conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_MODE</name>
                  <description>Enables FIFO mode. Data will be first read from FIFO to buffer and then goes to conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWMD</name>
              <description>Swing Back Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>DAC Trigger Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>Hardware trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <description>Software trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTGEN</name>
              <description>DAC Periodic Trigger Mode Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LATCH_CYC</name>
              <description>RCLK Cycles Before Data Latch</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_EN</name>
              <description>Buffer Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_USE_BUF</name>
                  <description>Not used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BUF</name>
                  <description>Used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREF_PTAT_EXT_SEL</name>
              <description>External On-Chip PTAT Current Reference Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SELECTED</name>
                  <description>Not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECTED</name>
                  <description>Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREF_ZTC_EXT_SEL</name>
              <description>External On-Chip ZTC Current Reference Select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SELECTED</name>
                  <description>Not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECTED</name>
                  <description>Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF_SPD_CTRL</name>
              <description>OPAMP as Buffer, Speed Control Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LLP_MODE</name>
                  <description>Lower Low-Power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_MODE</name>
                  <description>Low-Power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>DAC FIFO Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WML</name>
              <description>Watermark Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPR</name>
          <description>DAC FIFO Pointer</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFO_RPT</name>
              <description>FIFO Read Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_WPT</name>
              <description>FIFO Write Pointer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
