nxp-mcuxpresso/mcux-soc-svd/LPC5536/LPC5536.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT_BOD</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>GINT0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>GINT1</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT0</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT1</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT2</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT3</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>UTICK0</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>MRT0</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CTIMER0</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>CTIMER1</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>SCT0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>CTIMER3</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM0</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM1</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM2</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM3</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM4</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM5</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM6</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM7</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>ACMP</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>DMIC</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>HWVAD0</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>USB0_NEEDCLK</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>USB0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>EZH_ARCH_B0</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>WAKEUP</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT4</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT5</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT6</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>PIN_INT7</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>CTIMER2</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>CTIMER4</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>OS_EVENT</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>FlexSPI0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>Reserved56</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>Reserved57</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>Reserved58</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CAN0_IRQ0</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>CAN0_IRQ1</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>Reserved61</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>Reserved62</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>Reserved63</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>Reserved64</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>SEC_HYPERVISOR_CALL</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>SEC_GPIO_INT0_IRQ0</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>SEC_GPIO_INT0_IRQ1</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>Freqme</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>SEC_VIO</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>ELS</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>PKC</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>Reserved72</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>POWERQUAD</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>FLEXCOMM8</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>CDOG</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>Reserved77</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>I3C0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>Reserved79</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>Reserved80</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>ELS_IRQ1</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>Tamper</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>Reserved83</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>Reserved84</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>Reserved85</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>Reserved86</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>Reserved87</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>Reserved88</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>Reserved89</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>DAC0</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>DAC1</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>DAC2</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>HSCMP0</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>HSCMP1</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>HSCMP2</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_CAPTURE</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_FAULT</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD_ERROR</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_COMPARE0</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD0</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_COMPARE1</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD1</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_COMPARE2</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD2</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_COMPARE3</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD3</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_CAPTURE</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_FAULT</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_RELOAD_ERROR</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_COMPARE0</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_RELOAD0</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_COMPARE1</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_RELOAD1</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_COMPARE2</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_RELOAD2</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_COMPARE3</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_RELOAD3</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>ENC0_COMPARE</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>ENC0_HOME</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>ENC0_WDG</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>ENC0_IDX</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>ENC1_COMPARE</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>ENC1_HOME</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>ENC1_WDG</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>ENC1_IDX</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>Reserved126</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>Reserved127</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>ELS_ERR</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>PKC_ERR</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>Reserved130</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>Reserved131</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>Reserved132</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>Reserved133</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>FLASH</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>RAM_PARITY_ECC_ERR</name>
        <value>119</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
